[
  {
    "timestamp": "2025-08-07T03:51:29.584898",
    "query": "What specific safety procedures should be followed prior to conducting maintenance on moving parts?",
    "embedding_norm": 0.9999999626931951,
    "retrieved_docs": 3,
    "top_snippet": "26\n31200243\nSafety Section\nNever jump across the starter solenoid terminals in \norder to start the engine. Unexpected machine \nmovement could result.\nWhenever there are equipment control linkages the \nclearance in the linkage area will change with the \nmovement of the equipment or the machine. Stay clear \nof areas that may have a sudden change in clearance \nwith machine movement or equipment movement.\nIf it is necessary to remove guards in order to perform \nmaintenance, always install the guards after the \nmaintenance is performed.\nKeep objects away from moving fan blades. The fan \nblade will throw objects or cut objects.\nDo not use a kinked wire cable or a frayed wire cable. \nWear gloves when you handle wire cable.\nWhen you strike a retainer pin with force, the retainer \npin can fly out. The loose retainer pin can injure \npersonnel. Make sure that the area is clear of people \nwhen you strike a retainer pin. To avoid injury to your \neyes, wear protective glasses when you strike a \nretainer pin.\nChips or other debris can fly off an object when you \nstrike the object. Make sure that no one can be injured \nby flying debris before striking any object.\nBurn Prevention\nDo not touch any part of an operating engine. Allow \nthe engine to cool before any maintenance is \nperformed on the engine. Relieve all pressure in the air \nsystem, in the oil system, in the lubrication system, in the \nfuel system, or in the cooling system before any lines, \nfittings or related items are disconnected.\nCoolant\nWhen the engine is at operating temperature, the \nengine coolant is hot. The coolant is also under \npressure. The radiator and all lines to the heaters or to \nthe engine contain hot coolant.\nAny contact with hot coolant or with steam can cause \nsevere burns. Allow cooling system components to cool \nbefore the cooling system is drained.\nCheck the coolant level only after the engine has been \nstopped.\nEnsure that the filler cap is cool before removing the \nfiller cap. The filler cap must be cool enough to touch \nwith a bare hand. Remove the filler cap slowly in order \nto relieve pressure.\nCooling system conditioner contains alkali. Alkali can \ncause personal injury. Do not allow alkali to contact the \nskin, the eyes, or the mouth.\nStay clear of all rotating and moving parts.\nOils\nHot oil and hot components can cause personal injury. \nDo not allow hot oil to contact the skin. Also, do not \nallow hot components to contact the skin.\nRemove the hydraulic tank filler cap only after the \nengine has been stopped. The filler cap must be cool \nenough to touch with a bare hand. Follow the standard \nprocedure in this manual in order to remove the \nhydraulic tank filler cap.\nBatteries\nElectrolyte is an acid. Electrolyte can cause personal \ninjury. Do not allow electrolyte to contact the skin or the \neyes. Always wear protective glasses for servicing \nbatteries. Wash hands after touching the batteries and \nconnectors. Use of gloves is recommended.\nFire Prevention and Explosion \nPrevention\nIllustration 24\ng00704000\nAll fuels, most lubricants, and some coolant mixtures are \nflammable.\nFlammable fluids that are leaking or spilled onto hot \nsurfaces or onto electrical components can cause a \nfire. Fire may cause personal injury and property \ndamage.\nRemove all flammable materials such as fuel, oil, and \ndebris from the machine. Do not allow any flammable \nmaterials to accumulate on the machine.\nStore fuels and lubricants in properly marked \ncontainers away from unauthorized persons. Store oily \nrags and any flammable materials in protective \ncontainers. Do not smoke in areas that are used for \nstoring flammable materials.\n{Image_1 Cat TH360B Telehandler Operator and Maintanence Manual\\page_28_img_1.png description: The image contains two black silhouettes on a white background. The left silhouette depicts stylized flames, representing fire. The right silhouette shows an explosion with sharp, jagged edges, symbolizing a blast or detonation.}",
    "keyword_match_count": 0,
    "retrieval_strategy": "semantic",
    "retrieval_success": false
  }
]