[
  {
    "timestamp": "2025-08-06T13:23:17.123873",
    "query": "What are the specific safety precautions that should be followed when handling diesel fuel?",
    "embedding_norm": 1.000000038764492,
    "retrieved_docs": 3,
    "top_snippet": "5. Maintenance\n5-2016\n37\nA043D713 (Issue 5)\nCopyright © 2016 Cummins Inc.\n5.6\nMaintaining the Fuel System\nKeep dirt, water, and other contaminants from entering the fuel system and corroding or clogging fuel\nsystem components.\n5.6.1\nFuel System\nWARNING\nDiesel fuel leaks can lead to fire. Do not operate the generator set if operation causes fuel to\nleak.\n1. Check for leaks at the hose, tube, and pipe fittings in the fuel supply system while the generator set\nis running and while it is stopped.\n2. Check flexible fuel hoses sections for cuts, cracks, abrasions, and loose hose clamps.\n3. Make sure the fuel line does not rub against other parts of the vehicle or generator set.\n4. Replace worn or damaged fuel line parts before leaks occur.\n5.6.2\nFuel Recommendations\nWARNING\nDiesel fuel is combustible and can cause severe personal injury or death. Do not smoke near fuel\ntanks or fuel-burning equipment, or in areas sharing ventilation with such equipment. Keep\nflames, sparks, pilot flames, electrical arcs and switches, and all other sources of ignition well\naway. Keep a multi-class ABC fire extinguisher handy.\n•\nWhen the outdoor ambient temperature is above freezing, use clean, fresh No. 2 diesel fuel (ASTM\n2-D).\n•\nWhen the outdoor ambient temperature is below freezing, use No. 1 diesel fuel (ASTM 1-D).\nThe fuel should have a Cetane number of at least 45 for reliable starting.\n5.6.2.1 Bio-diesel Fuels B5 – B20\nB5 bio-diesel fuel that meets industry specifications and quality is suitable for use with this generator set.\nBefore using bio-diesel fuel blends above B5 and up to B20, the following conditions must be verified:\n•\nThe vehicle propulsion engine is capable of using B20 when sharing the same fuel tank.\n•\nThe OEM has installed a B20 compatible fuel line from the fuel tank to the generator set.\n•\nThe OEM has installed a water separator in the fuel line just before the generator set.\nFor bio-diesel blends above B5 and up to B20, Cummins Onan recommends that the fuel meet the\nspecifications outlined in ASTM D7467. The bio-diesel component of this fuel blend must meet ASTM\nD6751 or EN14214, and the petroleum diesel component must meet ASTM D975. Blended bio-diesel\nfuels should be pre-blended and not made by customers.\nCAUTION\nMarket applications contain properties that can affect engine operating characteristics. It is\nhighly recommended that use of these bio-diesel fuel blends be avoided or exercised with extra\ncare. Use standard fuels in applications that experience seasonal usage, storage for periods\nexceeding 90 days, and extreme temperatures or humidity.\n{Image_1 A043D713\\page_43_img_1.png description: The image is a yellow triangle with a black border, featuring a black exclamation mark in the center. This is a standard warning symbol.}",
    "keyword_match_count": 0,
    "retrieval_strategy": "semantic",
    "retrieval_success": false
  }
]