[
  {
    "timestamp": "2025-08-04T11:56:15.247625",
    "query": "What specific symptoms of carbon monoxide poisoning should operators be vigilant about?",
    "embedding_norm": 0.9999999631261942,
    "retrieved_docs": 3,
    "top_snippet": "1. Important Safety Instructions\n5-2016\n4\nA043D713 (Issue 5)\nCopyright © 2016 Cummins Inc.\n1.6\nGenerator Voltage Is Deadly\nWARNING\nImproperly connected generator electrical output connections can cause equipment damage,\nsevere personal injury, or death. Electrical connections must be made by a trained and\nexperienced electrician in accordance with applicable codes.\nWARNING\nImproper installations can cause equipment damage, severe personal injury, or death. All\ninstallations must be conducted by trained and experienced personnel in accordance with the\ninstallation instructions and all applicable codes.\nWARNING\nBack feed to shore power can cause electrocution and damage to equipment. The generator set\nmust not be connected to shore power or to any other source of electrical power. An approved\nswitching device must be used to prevent interconnections.\nWARNING\nLive electrical equipment can cause electrocution. Use caution when working on live electrical\nequipment. Remove jewelry, make sure clothing and shoes are dry, stand on a dry wooden\nplatform or rubber insulating mat, and use tools with insulated handles.\n1.7\nEngine Exhaust/Carbon Monoxide Is Deadly\nWARNING\nSubstances in exhaust gases have been identified by some state and federal agencies to cause\ncancer or reproductive toxicity. Do not breathe in or come into contact with exhaust gases.\nWARNING\nCarbon monoxide is a poisonous gas. Inhalation of this gas can cause severe personal injury or\ndeath. Adhere to the following bullet points to make sure carbon monoxide is not being inhaled\nby occupants of the vehicle as well as others working on or around the generator set.\n•\nInspect for exhaust leaks, and test and confirm that all carbon monoxide detectors are\nworking in accordance with the manufacturer's instructions or owner's manual, prior to\nevery startup, and after every 8 hours of running.\n•\nNever occupy the vehicle while the generator set is running unless the vehicle is equipped\nwith a working carbon monoxide detector.\n•\nNever operate the generator set when the vehicle is in a confined space, such as a garage,\nbasement, or building of any kind.\n•\nMake sure the exhaust system is installed in accordance with the generator set installation\nmanual.\n•\nNever use engine cooling air for heating a working or living space compartment.\nCarbon Monoxide (CO) is odorless, colorless, tasteless, and non-irritating. It cannot be seen or smelled.\nExposure, even to low levels of CO for a prolonged period can lead to asphyxiation (lack of oxygen).\n{Image_1 A043D713\\page_10_img_1.png description: The image is a yellow triangle with a black border, containing a black exclamation mark in the center. It is a standard warning symbol.}",
    "keyword_match_count": 3,
    "retrieval_strategy": "keyword",
    "retrieval_success": true
  }
]