[
  {
    "timestamp": "2025-08-04T13:14:09.508205",
    "query": "What are the best safety practices to follow when raising the boom?",
    "embedding_norm": 0.9999999570354158,
    "retrieved_docs": 3,
    "top_snippet": "30\n31200243\nSafety Section\nBefore Operation\nClear all personnel from the machine and from the area.\nClear all obstacles from the path of the machine. \nBeware of hazards such as wires, ditches, etc.\nMake sure that all windows are clean. Secure the doors \nin the open position or in the shut position. Secure the \nwindows in the open position or in the shut position.\nMake sure that all mirrors (if equipped) are clean. For \nthe best vision of the area which is close to the \nmachine, adjust the mirrors. All mirrors should be \nadjusted for optimal visibility while the operator is \nseated in the cab.\nMake sure that the machine horn, the backup alarm (if \nequipped), and all other warning devices are working \nproperly.\nFasten the seat belt securely.\nMake sure that the load charts and the instruction \nplates are in place and that the load charts and the \ninstructions can be read.\nOperation\nMachine Operating Temperature \nRange\nThe standard machine configuration is intended for \nuse within an ambient temperature range of -40 °C (-\n40 °F) to 50 °C (122 °F). Special configurations for \ndifferent ambient temperatures may be available. \nConsult your Caterpillar dealer for additional \ninformation on special configurations of your machine.\nMachine Operation\nCheck for proper operation of the steering controls and \nof the braking controls for the machine while the \nmachine is moving slowly in an open area. Check the \nsteering controls and the braking controls while the \nboom is retracted fully and the work tool is just clear of \nthe ground. With the machine in a stationary position, \ncheck for the proper operation of the other controls for \nthe machine. Unless the machine frame is level, do not \nraise the boom. The boom should only be extended if \nthe machine frame is level. Extend the boom and retract \nthe boom several times in order to warm the hydraulic \noil.\nTravel\nOnly operate the machine while you are in a seat. The \nseat belt must be fastened while you operate the \nmachine. Only operate the controls while the engine is \nrunning.\nWhen you travel on the roadways, operate the \nmachine in two-wheel steer mode only.\nBefore you maneuver the machine, make sure that no \npersonnel are between the machine and the work tools. \nUse caution when you change direction of travel. Use \ncaution when you operate the boom. Use caution when \nyou are picking up loads or when you are setting down \nloads. Travel in the direction of the best visibility. Travel \nwith the boom fully retracted. Also, travel with the boom \nlowered as far as possible. Maintain adequate ground \nclearance for conditions. Never travel if a load is raised \nbeyond the travel position. Be careful to avoid any \nground condition which could cause the machine to tip. \nAvoid any conditions that can lead to tipping of the \nmachine. The machine can tip when you work on the \nfollowing obstacles: banks, hills, and slopes. If the \nmachine is equipped with stabilizers the stabilizers must \nbe fully raised before you move the machine.\nLifting Capacities\nMaintain control of the machine. Do not overload the \nmachine beyond the machine capacity. Ensure that the \ncorrect load chart is referenced. Loads must be within \nthe weight limit of the machine and loads must be within \nthe load center limit for the machine. Lifting capacity \ndecreases as the load is moved further from the \nmachine.\nNote: If an 180-6137 Coupler Adapter Gp for a work \ntool is installed on the quick coupler, reduce the load \ncarrying capacity of the machine by 200 kg (440 lb) for \nall work tools and with the boom in any position. Refer \nto Operation and Maintenance Manual, \"Lifting \nCapacities\" for additional information.\nEnsure that the tires are serviceable and that the tires \nare inflated to the correct pressure.\nOn machines that are equipped with a frame leveling \nswitch, always level the frame before you raise the \nboom or before you lower the stabilizers. Never \noperate the frame leveling switch when the boom is \nraised or when the stabilizers are lowered. Check that \nthe frame is level after you lower the stabilizers. If \nnecessary, adjust the level of the frame. Use the \nstabilizers in order to make the adjustment. Do not \nadjust the position of the stabilizers when the boom is \nraised. If the frame is not level, do not raise the boom.\nBefore you transport a load or before you elevate a \nload, the load must be adequately secured on the forks \nor on the work tool. Any loads such as pipe, \nscaffolding, lumber and beams must be adequately \nsecured.\nUse lifting slings that are approved and use lifting \nslings that are load tested. Also, all wire ropes or \nchains must be properly maintained. The wire ropes \nand chains must meet local regulations. You must know \nthe load carrying capacity of these devices and you \nmust know the correct use of these devices.",
    "keyword_match_count": 0,
    "retrieval_strategy": "semantic",
    "retrieval_success": false
  }
]