[
  {
    "timestamp": "2025-08-04T13:13:56.753414",
    "query": "What are the best practices for ensuring the frame is level before raising the boom?",
    "embedding_norm": 0.9999999832609919,
    "retrieved_docs": 3,
    "top_snippet": "54\n31200243\nOperation Section\n2. Turn the steering wheel until the left rear wheel is in line \nwith the side of the machine.\nIllustration 67\ng00603632\n2. Change to two-wheel steer and turn the steering \nwheel until the left front wheel is in line with the side \nof the machine.\n3. Change to either crab steer mode or circle steer \nmode, as required.\nSteering Arrangement with Self-Aligning Rear \nSteering\nYour machine may be equipped with self-aligning rear \nsteering. The self-aligning feature ensures that the rear \nwheels are aligned before the steering mode is \nchanged.\nWhen switch (3) is pressed by the operator, the \nmachine will not change to the desired steering mode \nunless the rear wheels are in the straight ahead \nposition.\nIf switch (3) is pressed by the operator and the rear \nwheels of the machine are not aligned, the current \nsteering mode will remain selected. The indicator for the \ncurrent steering mode on the display panel will remain \non, and the desired mode indicator will flash. When the \nrear wheels are moved to the straight ahead position \nby the operator, the steering mode will then change to \nthe desired mode.\nFrame Leveling Control (4)\nImproper use of the frame leveling control could result \nin personal injury or death. Always level the machine \nframe and load before raising the boom. Never use the \nframe leveling control when the boom is raised with a \nload or without a load. Never use the frame leveling \ncontrol to increase the sideways slope of the machine \nframe.\nIf equipped, the frame leveling control (switch) is a \nthree-position switch.\nThe frame leveling control is used to level the machine \nwhen the machine is on an uneven surface. The frame \nleveling control can cause the frame to tilt to the left or \nto the right. The maximum amount of tilt is 10 degrees \nin either of these directions.\nLower the boom before you use the frame leveling \ncontrol. The boom must be close to the ground.\nPress the right side of the switch in order to lower the \nright side of the frame. The frame rotates clockwise in \nrelation to the axles.\nPress the left side of the switch in order to lower the left \nside of the frame. The frame rotates counterclockwise \nin relation to the axles.\nWhen the switch is released, the frame leveling control \nreturns to the HOLD position.\nUse the level indicator to determine when the frame is \nlevel. The frame is level when the bubble is in the middle \nof the sight glass.\nFrame Level Interlock (If Equipped)\nWhen the boom is extended outward, the frame level \nwill be isolated. The operator will not be able to use the \nframe level function until the boom has been fully \nretracted.\nThe operation of the Frame Level Interlock will not \naffect any other functions of the machine hydraulics.\nStabilizer Controls (5), (6)\nMachine instability could result if the following \nconditions are not observed:\nThe proper load chart is used. The capacities that are \nshown on the load charts are not exceeded.\nThe boom is fully retracted and lowered to the travel \nposition before raising the stabilizers.\nThe areas adjacent to the stabilizers are clear and will \nprovide uniform support for weight of the machine and \nintended load.\nThe machine is not leveled using the frame level \ncontrol when the stabilizers are lowered.\nThe stabilizers are not used except as described in the \nfollowing instructions. Incorrect use of stabilizers \ncould result in injury or death.\nDo not operate the stabilizers when personnel are \nnearby. Ensure that personnel stand clear when the \nstabilizers are being raised or lowered. Ensure that both \nstabilizers are fully raised before moving the machine. \nOperating the stabilizers when personnel are nearby \ncould result in personal injury or death.\n{Image_1 Cat TH360B Telehandler Operator and Maintanence Manual\\page_56_img_1.png description: The image displays a black rectangular warning label with a white exclamation mark inside a triangle, followed by the word \"WARNING\" in bold white letters.}\n{Image_2 Cat TH360B Telehandler Operator and Maintanence Manual\\page_56_img_2.png description: The image is a technical drawing showing a side view of a vehicle with a driver inside. The top half illustrates the vehicle's cabin and driver, while the bottom half shows the vehicle's undercarriage, including mechanical components. The drawing is in a simple line-art style.}",
    "keyword_match_count": 0,
    "retrieval_strategy": "semantic",
    "retrieval_success": false
  }
]